app/views/incomes/show.html.erb


<% epin=(IncomeEp.where(:income_id =>@income.id)).first %>
---
SELECT "income_eps".* FROM "income_eps" WHERE "income_eps"."income_id" = 1 LIMIT 1


<% tnin=(IncomeTn.where("income_id = ?",@income.id)).first %>
---
SELECT "income_tns".* FROM "income_tns" WHERE (income_id = 2) LIMIT 1


<% evin=(IncomeEvent.where("income_id = ?",@income.id)).first %>
---
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
SELECT "income_events".* FROM "income_events" WHERE (income_id = 2) LIMIT 1