app/views/requests/_form.html.erb

SELECT DISTINCT committee FROM "users"
---
    <%= f.label :para %><br />
    <%= select_tag(:para, options_from_collection_for_select(User.select(:committee).uniq,:committee,:committee)) %>