app/views/income_events/_form.html.erb

SELECT "events".* FROM "events"
---
    <%= f.label :event %><br />
    <%= select_tag(:event_id, options_from_collection_for_select(Event.all,:id, :name)) %>