app/controllers/egress_events_controller.rb

  def index
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @egress_events = EgressEvent.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "egress_events".* FROM "egress_events"

  def show
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @egress_event = EgressEvent.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "egress_events".* FROM "egress_events" WHERE "egress_events"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1

  def new
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @egress_event = EgressEvent.new
    @egress = Egress.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "egresses".* FROM "egresses" WHERE "egresses"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @egress_event = EgressEvent.new(params[:egress_event])
    e=Egress.find(params[:egress])
    @egress_event.event_id = ((Event.where(:id => params[:event])).first).id
    @egress_event.egress_id=e.id


    respond_to do |format|
      if @egress_event.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "egresses".* FROM "egresses" WHERE "egresses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
INSERT INTO "egress_events" ("created_at", "egress_id", "event_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 28 Sep 2012 18:52:23 UTC +00:00], ["egress_id", 1], ["event_id", 1], ["updated_at", Fri, 28 Sep 2012 18:52:23 UTC +00:00]]

  def destroy
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @egress_event = EgressEvent.find(params[:id])
    @egress_event.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "egress_events".* FROM "egress_events" WHERE "egress_events"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "egress_events" WHERE "egress_events"."id" = ?  [["id", 1]]