app/controllers/egresses_controller.rb

  def index
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    if u.role == 'Admin'
    @egresses = Egress.all
    end
    if u.role == 'Member'
    @egresses = Egress.where(:user_id => u.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "egresses".* FROM "egresses"
SELECT "egresses".* FROM "egresses" WHERE "egresses"."user_id" = 8

  def show
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')
    @egress = Egress.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "egresses".* FROM "egresses" WHERE "egresses"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    u=User.find(session[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def edit
   u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')
    @egress = Egress.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "egresses".* FROM "egresses" WHERE "egresses"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')
    @egress = Egress.new(params[:egress])
    @egress.type_of_payment=(params[:type_of_payment])
    @egress.user=u
    respond_to do |format|
      if @egress.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "egresses" ("amount", "created_at", "date", "invoice_number", "operation_number", "reason", "type_of_payment", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)