app/controllers/events_controller.rb

  def index
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @events = Event.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "events".* FROM "events"

  def show
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @event = Event.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    u=User.find(session[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def create
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @event = Event.new(params[:event])
    @event.user=u
    respond_to do |format|
      if @event.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "events" ("created_at", "description", "event_date", "expense", "name", "oc", "profit", "recomendations", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)