app/controllers/incomes_controller.rb

  def index
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    if u.role == 'Admin'
    @incomes = Income.all
    end
    if u.role == 'Member'
    @incomes = Income.where(:user_id => u.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "incomes".* FROM "incomes"
SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = 1

  def show
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')
    @income = Income.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    u=User.find(session[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')
    @income = Income.new(params[:income])
    @income.user=u
    respond_to do |format|
      if @income.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "incomes" ("amount", "created_at", "deposit_date", "invoice_number", "operation_number", "reason", "type_of_payment", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income = Income.find(params[:id])
    @income.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "incomes" WHERE "incomes"."id" = ?  [["id", 1]]