app/controllers/income_events_controller.rb

  def show
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_event = IncomeEvent.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
SELECT "income_events".* FROM "income_events" WHERE "income_events"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_event = IncomeEvent.new
    @income = Income.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "4"]]

  def create

    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_event = IncomeEvent.new(params[:income_event])
    i=Income.find(params[:income])
    @income_event.event_id = ((Event.where(:id => params[:event])).first).id
    @income_event.income_id=i.id


    respond_to do |format|
      if @income_event.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
INSERT INTO "income_events" ("created_at", "event_id", "income_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 28 Sep 2012 18:40:37 UTC +00:00], ["event_id", 1], ["income_id", 4], ["updated_at", Fri, 28 Sep 2012 18:40:37 UTC +00:00]]

  def destroy
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_event = IncomeEvent.find(params[:id])
    @income_event.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "income_events".* FROM "income_events" WHERE "income_events"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "income_events" WHERE "income_events"."id" = ?  [["id", 1]]