app/controllers/income_tns_controller.rb

  def show
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_tn = IncomeTn.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "income_tns".* FROM "income_tns" WHERE "income_tns"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_tn = IncomeTn.new
    @income = Income.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_tn = IncomeTn.new(params[:income_tn])

    i=Income.find(params[:income])
    @income_tn.tn_id = ((Tn.where(:id => params[:tn])).first).id
    @income_tn.income_id=i.id

    respond_to do |format|
      if @income_tn.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "income_tns" ("created_at", "income_id", "tn_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 28 Sep 2012 15:03:20 UTC +00:00], ["income_id", 3], ["tn_id", 1], ["updated_at", Fri, 28 Sep 2012 15:03:20 UTC +00:00]]

  def destroy
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_tn = IncomeTn.find(params[:id])
    @income_tn.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "income_tns".* FROM "income_tns" WHERE "income_tns"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "income_tns" WHERE "income_tns"."id" = ?  [["id", 1]]