app/controllers/income_eps_controller.rb

  def index
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_eps = IncomeEp.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "income_eps".* FROM "income_eps"

  def show
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_ep = IncomeEp.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "income_eps".* FROM "income_eps" WHERE "income_eps"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_ep = IncomeEp.new
    @income = Income.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_ep = IncomeEp.new(params[:income_ep])
    i=Income.find(params[:income])
    @income_ep.ep_id = ((Ep.where(:id => params[:ep])).first).id
    @income_ep.income_id=i.id
    respond_to do |format|
      if @income_ep.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "income_eps" ("created_at", "ep_id", "income_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 28 Sep 2012 14:42:46 UTC +00:00], ["ep_id", nil], ["income_id", 2], ["updated_at", Fri, 28 Sep 2012 14:42:46 UTC +00:00]]

  def destroy
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @income_ep = IncomeEp.find(params[:id])
    @income_ep.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "income_eps".* FROM "income_eps" WHERE "income_eps"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "income_eps" WHERE "income_eps"."id" = ?  [["id", 6]]