app/controllers/requests_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "requests".* FROM "requests" WHERE (para ='USB' OR user_id = 1)
---
  def index
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    if u.role == 'Admin'
    @requests=Request.where(:para => 'MC')

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')
    @request = Request.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    u=User.find(session[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "requests" ("account_number", "account_type", "amount", "bank", "created_at", "identification", "name", "para", "reason", "request_date", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @request = Request.new(params[:request])
    @request.para=(params[:para])
    @request.account_type=(params[:account_type])
    @request.status='nuevo'
    @request.user=u
    respond_to do |format|
      if @request.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]
---
  def destroy
    u=User.find(session[:user])
    if (u.role=='Admin' || u.role=='Member')

    @request = Request.find(params[:id])
    @request.destroy