app/controllers/users_controller.rb

  def index
  u=User.find(session[:user])
     if u.role=='Admin'
       @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"

  def create

    @user = User.new(params[:user])
    @user.committee=(params[:committee])
    @user.phone=0
    @user.area=(params[:area])
    @user.role=(params[:role])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("area", "committee", "created_at", "email", "name", "password", "phone", "role", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def update
    @user = User.find(params[:id])
    @user.committee=(params[:committee])
    @user.area=(params[:area])
    @user.phone=0
    @user.role=(params[:role])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "users" SET "role" = 'Admin', "password" = 'HOLA', "updated_at" = '2012-09-29 15:43:13.384861' WHERE "users"."id" = 7

def signup
    @user = User.new(params[:user])
    @user.committee=(params[:committee])
    @user.phone=0
    @user.area=(params[:area])
    @user.role='Nuevo'
    if request.post?

      if @user.save
---
INSERT INTO "users" ("area", "committee", "created_at", "email", "name", "password", "phone", "role", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)