app/views/egress_events/_form.html.erb

    <%= f.label :event %><br />
    <%= select_tag(:event, options_from_collection_for_select(Event.all,:id, :name)) %>
---
SELECT "events".* FROM "events"