app/views/egresses/show.html.erb

SELECT "egress_events".* FROM "egress_events" WHERE (egress_id = 1) LIMIT 1
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
---

<% eveg=(EgressEvent.where("egress_id = ?",@egress.id)).first %>